{
  "common": {
    "name": "brightsky",
    "version": "0.3.1",
    "news": {
      "0.3.1": {
        "en": "Fixed data evaluation crash when no panels are defined  \nstate name fixed",
        "de": "Behoben: Abbruch der Datenauswertung, wenn keine Panels definiert sind\nState common.name korrigiert",
        "ru": "Исправлена ошибка сбоя при оценке данных, если панели не определены\nИсправлено имя состояния",
        "pt": "Corrigido erro de falha na avaliação de dados quando nenhum painel é definido\nNome do estado corrigido.",
        "nl": "Opgelost: Crash bij het evalueren van gegevens wanneer er geen panelen zijn gedefinieerd\nStatusnaam hersteld",
        "fr": "Correction du plantage de l'évaluation des données lorsque aucun panneau n'est défini\nNom de l'état corrigé",
        "it": "Risolto il crash dell'elaborazione dei dati quando non vengono definite pannelli.\nStato del nome corretto",
        "es": "Corregido fallo en la evaluación de datos cuando no se definen paneles\nNombre del estado corregido",
        "pl": "Naprawiono awarię evaluacji danych, gdy nie zdefiniowano żadnych paneli.\nstan nazwy naprawiony",
        "uk": "Виправлено аварійне завершення оцінки даних, коли не визначено панелі\nВиправлено назву стану",
        "zh-cn": "修复当未定义面板时数据评估崩溃的问题\n修正了状态名称"
      },
      "0.3.0": {
        "en": "Added experimental datapoint for solar energy estimation (daily and hourly); Wind bearing text translated into ioBroker system language; Added new datapoint for MDI icons support; Add day and night objects in addition to daily objects; Enhanced day and night support with dedicated day/night icons",
        "de": "Experimentellen Datenpunkt für Solarenergie-Schätzung (täglich und stündlich) hinzugefügt; Windrichtungs-Text wird in die ioBroker-Systemsprache übersetzt; Neuen Datenpunkt für MDI-Icons hinzugefügt; Tag- und Nacht-Objekte zusätzlich zu täglichen Objekten hinzugefügt; Verbesserte Tag-/Nacht-Unterstützung mit eigenen Tag-/Nacht-Icons",
        "ru": "Добавлен экспериментальный датапоинт для оценки солнечной энергии (ежедневно и ежечасно); Текст направления ветра переведен на системный язык ioBroker; Добавлен новый датапоинт для поддержки MDI-иконок; Добавлены дневные и ночные объекты в дополнение к ежедневным; Улучшена поддержка дня и ночи с выделенными иконками дня/ночи",
        "pt": "Adicionado ponto de dados experimental para estimativa de energia solar (diária e horária); Texto da direção do vento traduzido para o idioma do sistema ioBroker; Adicionado novo ponto de dados para suporte a ícones MDI; Adicionados objetos de dia e noite além de objetos diários; Suporte de dia e noite aprimorado com ícones dedicados de dia/noite",
        "nl": "Experimenteel datapunt toegevoegd voor zonne-energie schatting (dagelijks en elk uur); Windrichtingtekst vertaald naar de ioBroker-systeemtaal; Nieuw datapunt toegevoegd voor MDI-iconen ondersteuning; Dag- en nachtobjecten toegevoegd naast dagelijkse objecten; Verbeterde dag- en nachtondersteuning met speciale dag/nacht-iconen",
        "fr": "Ajout d'un point de données expérimental pour l'estimation de l'énergie solaire (quotidienne et horaire); Texte de direction du vent traduit dans la langue du système ioBroker; Nouveau point de données ajouté pour le support des icônes MDI; Ajout d'objets de jour et de nuit en plus des objets quotidiens; Prise en charge améliorée du jour et de la nuit avec des icônes dédiées",
        "it": "Aggiunto datapoint sperimentale per la stima dell'energia solare (giornaliera e oraria); Testo della direzione del vento tradotto nella lingua di sistema di ioBroker; Aggiunto nuovo datapoint per il supporto delle icone MDI; Aggiunti oggetti giorno e notte oltre agli oggetti giornalieri; Supporto giorno/notte migliorato con icone dedicate",
        "es": "Añadido punto de datos experimental para la estimación de energía solar (diaria y por hora); Texto de la dirección del viento traducido al idioma del sistema ioBroker; Añadido nuevo punto de datos para soporte de iconos MDI; Añadidos objetos de día y noche además de objetos diarios; Soporte de día y noche mejorado con iconos dedicados",
        "pl": "Dodano eksperymentalny punkt danych do szacowania energii słonecznej (dziennie i godzinowo); Tekst kierunku wiatru przetłumaczony na język systemowy ioBroker; Dodano nowy punkt danych dla obsługi ikon MDI; Dodano obiekty dzienne i nocne oprócz obiektów codziennych; Ulepszono obsługę dnia i nocy z dedykowanymi ikonami dnia/nocy",
        "uk": "Додано експериментальний датапоінт для оцінки сонячної енергії (щоденно та щогодини); Текст напрямку вітру перекладено мовою системи ioBroker; Додано новий датапоінт для підтримки іконок MDI; Додано денні та нічні об'єкти на додаток до щоденних; Покращена підтримка дня та ночі з окремими іконками дня/ночі",
        "zh-cn": "新增用于太阳能估算（每日和每小时）的实验性数据点；风向文本翻译为 ioBroker 系统语言；新增支持 MDI 图标的数据点；除了每日对象外，还新增白天和夜间对象；改进了昼夜支持，提供专用的昼夜图标"
      },
      "0.2.5": {
        "en": "Add day and night objects in addition to daily objects",
        "de": "Tag- und Nacht-Objekte zusätzlich zu täglich Objekten hinzufügen",
        "ru": "Добавить дневные и ночные объекты в дополнение к ежедневным объектам",
        "pt": "Adicionar objetos diurnos e noturnos além de objetos diários",
        "nl": "Dag- en nachtobjecten toevoegen naast dagelijkse objecten",
        "fr": "Ajouter des objets de jour et de nuit en plus des objets quotidiens",
        "it": "Aggiungi oggetti giorno e notte oltre agli oggetti giornalieri",
        "es": "Añadir objetos de día y noche además de objetos diarios",
        "pl": "Dodaj obiekty dzienne i nocne oprócz obiektów codziennych",
        "uk": "Додати денні та нічні об'єкти на додаток до щоденних об'єктів",
        "zh-cn": "除了每日对象外，还添加白天和夜间对象"
      },
      "0.2.4": {
        "en": "Create all folders",
        "de": "Alle Ordner erstellen",
        "ru": "Создаем все папки",
        "pt": "Criar todas as pastas",
        "nl": "Alle mappen aanmaken",
        "fr": "Créer tous les dossiers",
        "it": "Crea tutte le cartelle",
        "es": "Crear todas las carpetas",
        "pl": "Utwórz wszystkie foldery",
        "uk": "Створіть всі папки",
        "zh-cn": "创建全部文件夹"
      },
      "0.2.3": {
        "en": "wind bearing text added\nupdate deps",
        "de": "windlager text hinzugefügt\nupdate deps",
        "ru": "ветровой подшипник текст\nобновление deps",
        "pt": "texto de rolamento de vento adicionado\natualizar deps",
        "nl": "windlager tekst toegevoegd\nupdate deps",
        "fr": "texte de roulement à vent ajouté\nmettre à jour les deps",
        "it": "testo del cuscinetto del vento aggiunto\naggiornamento dep",
        "es": "texto añadido\nactualización de los deps",
        "pl": "dodany tekst nośnika wiatru\naktualizacje deps",
        "uk": "оболонка тексту додано\nоновлення deps",
        "zh-cn": "添加风向标文字\n更新代码"
      },
      "0.2.2": {
        "en": "Sunrise and sunset times added to the daily overview.",
        "de": "Sonnenaufgang und Sonnenuntergang in der Tagesübersicht.",
        "ru": "Время восхода и заката добавлено к ежедневному обзору.",
        "pt": "O nascer do sol e o pôr do sol somaram-se ao panorama diário.",
        "nl": "Zonsopgang en zonsondergang tijden toegevoegd aan het dagelijkse overzicht.",
        "fr": "Les heures du lever et du coucher du soleil s'ajoutent à l'aperçu quotidien.",
        "it": "Tempi di alba e tramonto aggiunti alla panoramica giornaliera.",
        "es": "Tiempos de amanecer y puesta de sol añadidos a la visión general diaria.",
        "pl": "Czas wschodu słońca i zachodu słońca dodawany do codziennego przeglądu.",
        "uk": "Сонце і час заходу додано до щоденного огляду.",
        "zh-cn": "日出和日落时间加进了每日概览."
      },
      "0.2.1": {
        "en": "Startup log entry fixed.",
        "de": "Start-Log-Eintrag behoben.",
        "ru": "Запись журнала запуска фиксирована.",
        "pt": "Entrada de registo inicial corrigida.",
        "nl": "Opstart log entry gerepareerd.",
        "fr": "Entrée de journal de démarrage corrigée.",
        "it": "Entrata del registro di avvio fissa.",
        "es": "Entrada de inicio fijada.",
        "pl": "Wpis do rejestru startowego naprawiony.",
        "uk": "Зареєструвати запис входу в систему.",
        "zh-cn": "启动日志输入已固定 ."
      }
    },
    "titleLang": {
      "en": "Bright Sky",
      "de": "Bright Sky",
      "ru": "Bright Sky",
      "pt": "Bright Sky",
      "nl": "Bright Sky",
      "fr": "Bright Sky",
      "it": "Bright Sky",
      "es": "Bright Sky",
      "pl": "Bright Sky",
      "uk": "Bright Sky",
      "zh-cn": "Bright Sky"
    },
    "desc": {
      "en": "Retrieve data from Bright Sky",
      "de": "Daten vom Bright Sky abrufen",
      "ru": "Получить данные с яркого неба",
      "pt": "Recuperar dados do céu brilhante",
      "nl": "Gegevens ophalen van Bright Sky",
      "fr": "Récupérer les données de Bright Sky",
      "it": "Recupera i dati dal cielo luminoso",
      "es": "Recuperar datos de Bright Sky",
      "pl": "Odzyskać dane z jasnego nieba",
      "uk": "Отримати дані з яскравого неба",
      "zh-cn": "从明亮的天空检索数据"
    },
    "authors": [
      "ticaki <github@renopoint.de>"
    ],
    "keywords": [
      "weather",
      "Bright Sky"
    ],
    "licenseInformation": {
      "type": "free",
      "license": "MIT"
    },
    "platform": "Javascript/Node.js",
    "icon": "brightsky.png",
    "enabled": true,
    "extIcon": "https://raw.githubusercontent.com/ticaki/ioBroker.brightsky/main/admin/brightsky.png",
    "readme": "https://github.com/ticaki/ioBroker.brightsky/blob/main/README.md",
    "loglevel": "info",
    "tier": 2,
    "mode": "daemon",
    "type": "weather",
    "compact": true,
    "connectionType": "cloud",
    "dataSource": "poll",
    "adminUI": {
      "config": "json"
    },
    "dependencies": [
      {
        "js-controller": ">=6.0.11"
      }
    ],
    "globalDependencies": [
      {
        "admin": ">=7.6.17"
      }
    ]
  },
  "native": {
    "position": "",
    "pollInterval": 1,
    "maxDistance": 50000
  },
  "objects": [],
  "instanceObjects": [
    {
      "_id": "info",
      "type": "channel",
      "common": {
        "name": "Information"
      },
      "native": {}
    },
    {
      "_id": "info.connection",
      "type": "state",
      "common": {
        "role": "indicator.connected",
        "name": "Device or service connected",
        "type": "boolean",
        "read": true,
        "write": false,
        "def": false
      },
      "native": {}
    }
  ]
}
